// ---------------公共的方法----------------------

$(function(){




// ---------------------- --实现图片出现介绍  ----------------------------------



$(".xianshi1").hover(function(){
           
	   $(this).animate({"top":"50px"},800);
							  },
					function(){
	    $(this).animate({"top":"180px"},800);
							   }



)



// --------------------------文字淡入淡出-------------------------------------------------
        

$(".a1").click(function(){
         $(".a1").css("width","50px");
         $(this).animate({"width":"944px"},800);

})


























})







































